namespace Transcriptor.HanguelRomanization.Functions;
delegate char MapJamoBlock(char c);
static class MapJamoBlocks
{
    static readonly Dictionary<char, char> basicToCompatibleJamoMapping = new ()
    {
        { '\u1100', 'ㄱ' }, // ㄱ -> ㄱ
        { '\u1101', 'ㄲ' }, // ㄲ -> ㄲ
        { '\u1102', 'ㄴ' }, // ㄴ -> ㄴ
        { '\u1103', 'ㄷ' }, // ㄷ -> ㄷ
        { '\u1104', 'ㄸ' }, // ㄸ -> ㄸ
        { '\u1105', 'ㄹ' }, // ㄹ -> ㄹ
        { '\u1106', 'ㅁ' }, // ㅁ -> ㅁ
        { '\u1107', 'ㅂ' }, // ㅂ -> ㅂ
        { '\u1108', 'ㅃ' }, // ㅃ -> ㅃ
        { '\u1109', 'ㅅ' }, // ㅅ -> ㅅ
        { '\u110A', 'ㅆ' }, // ㅆ -> ㅆ
        { '\u110B', 'ㅇ' }, // ㅇ -> ㅇ
        { '\u110C', 'ㅈ' }, // ㅈ -> ㅈ
        { '\u110D', 'ㅉ' }, // ㅉ -> ㅉ
        { '\u110E', 'ㅊ' }, // ㅊ -> ㅊ
        { '\u110F', 'ㅋ' }, // ㅋ -> ㅋ
        { '\u1110', 'ㅌ' }, // ㅌ -> ㅌ
        { '\u1111', 'ㅍ' }, // ㅍ -> ㅍ
        { '\u1112', 'ㅎ' }, // ㅎ -> ㅎ
        { '\u1161', 'ㅏ' }, // ㅏ -> ㅏ
        { '\u1162', 'ㅐ' }, // ㅐ -> ㅐ
        { '\u1163', 'ㅑ' }, // ㅑ -> ㅑ
        { '\u1164', 'ㅒ' }, // ㅒ -> ㅒ
        { '\u1165', 'ㅓ' }, // ㅓ -> ㅓ
        { '\u1166', 'ㅔ' }, // ㅔ -> ㅔ
        { '\u1167', 'ㅕ' }, // ㅕ -> ㅕ
        { '\u1168', 'ㅖ' }, // ㅖ -> ㅖ
        { '\u1169', 'ㅗ' }, // ㅗ -> ㅗ
        { '\u116A', 'ㅘ' }, // ㅘ -> ㅘ
        { '\u116B', 'ㅙ' }, // ㅙ -> ㅙ
        { '\u116C', 'ㅚ' }, // ㅚ -> ㅚ
        { '\u116D', 'ㅛ' }, // ㅛ -> ㅛ
        { '\u116E', 'ㅜ' }, // ㅜ -> ㅜ
        { '\u116F', 'ㅝ' }, // ㅝ -> ㅝ
        { '\u1170', 'ㅞ' }, // ㅞ -> ㅞ
        { '\u1171', 'ㅟ' }, // ㅟ -> ㅟ
        { '\u1172', 'ㅠ' }, // ㅠ -> ㅠ
        { '\u1173', 'ㅡ' }, // ㅡ -> ㅡ
        { '\u1174', 'ㅢ' }, // ㅢ -> ㅢ
        { '\u1175', 'ㅣ' }, // ㅣ -> ㅣ
    };
    public static MapJamoBlock BasicToCompatible => c => 
        basicToCompatibleJamoMapping.TryGetValue(c, out var jamo) ? jamo : c;
}